zjw939057120/LiteOS/targets/GD32F470IGH6/Src/usart.c
    /* UART6_Tx的模式设置 */
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_7);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_7);

    /* UART6_Rx的模式设置 */
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_6);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_6);

    /* 配置UART的参数 */
    usart_deinit(UART6);                                 /* 复位UART6 */
    usart_baudrate_set(UART6, bound);                    /* 设置波特率 */
    usart_stop_bit_set(UART6, USART_STB_1BIT);           /* 一个停止位 */
    usart_word_length_set(UART6, USART_WL_8BIT);         /* 字长为8位数据格式 */
    usart_parity_config(UART6, USART_PM_NONE);           /* 无奇偶校验位 */
    usart_transmit_config(UART6, USART_TRANSMIT_ENABLE); /* 使能发送 */
#if USART_EN_RX  /* 如果使能了接收 */
    usart_receive_config(UART6, USART_RECEIVE_ENABLE);   /* 使能接收 */
    // usart_interrupt_enable(UART6, USART_INT_RBNE);       /* 使能接收缓冲区非空中断 */
	// usart_interrupt_enable(UART6, USART_INT_IDLE);       /* 使能空闲线中断 */    
    // /* 配置NVIC，并设置中断优先级 */
    // nvic_irq_enable(UART6_IRQn, 0, 0);                   /* 抢占优先级0，子优先级0 */
    Usart6Hwi();
#endif
    /* 清除接收缓冲区残留数据 */
    (void)usart_data_receive(UART6);
    usart_flag_clear(UART6, USART_FLAG_RBNE);

    usart_enable(UART6);	                                /* 使能串口 */
}
//串口发送单字节函数
void Seria_SendByte(uint32_t USARTx,uint8_t Byte)
{
	usart_data_transmit(USARTx, Byte); 	
	while (usart_flag_get(USARTx, USART_FLAG_TC) == RESET); 
}
//串口发送一组数据函数
void Seria_SendArray(uint32_t USARTx, const uint8_t *Array, uint16_t Length) 
{ 	
	uint16_t i; 	
	for (i = 0; i < Length; i ++) 	
	{ 		
		Seria_SendByte(USARTx,Array[i]); 	
	} 
}

void Usart0Hwi(void){
    nvic_irq_enable(USART0_IRQn, 0, 0);
    usart_flag_clear(USART0, USART_INT_RBNE);
    usart_flag_clear(USART0, USART_INT_IDLE);
    LOS_HwiCreate((USART0_IRQn + 16), 0, 0, USART0_IRQHandler, NULL);
    usart_interrupt_enable(USART0, USART_INT_RBNE);
    usart_interrupt_enable(USART0, USART_INT_IDLE);
}
void Usart1Hwi(void){
    nvic_irq_enable(USART1_IRQn, 0, 0);
    usart_flag_clear(USART1, USART_INT_RBNE);
    usart_flag_clear(USART1, USART_INT_IDLE);
    LOS_HwiCreate((USART1_IRQn + 16), 0, 0, USART1_IRQHandler, NULL);
    usart_interrupt_enable(USART1, USART_INT_RBNE);
    usart_interrupt_enable(USART1, USART_INT_IDLE);
}
void Usart2Hwi(void){
    nvic_irq_enable(USART2_IRQn, 0, 0);
    usart_flag_clear(USART2, USART_INT_RBNE);
    usart_flag_clear(USART2, USART_INT_IDLE);
    LOS_HwiCreate((USART2_IRQn + 16), 0, 0, USART2_IRQHandler, NULL);
    usart_interrupt_enable(USART2, USART_INT_RBNE);
    usart_interrupt_enable(USART2, USART_INT_IDLE);
}
void Usart3Hwi(void){
    nvic_irq_enable(UART3_IRQn, 0, 0);
    usart_flag_clear(UART3, USART_INT_RBNE);
    usart_flag_clear(UART3, USART_INT_IDLE);
    LOS_HwiCreate((UART3_IRQn + 16), 0, 0, UART3_IRQHandler, NULL);
    usart_interrupt_enable(UART3, USART_INT_RBNE);
    usart_interrupt_enable(UART3, USART_INT_IDLE);
}

void Usart4Hwi(void){
    nvic_irq_enable(UART4_IRQn, 0, 0);
    usart_flag_clear(UART4, USART_INT_RBNE);
    usart_flag_clear(UART4, USART_INT_IDLE);
    LOS_HwiCreate((UART4_IRQn + 16), 0, 0, UART4_IRQHandler, NULL);
    usart_interrupt_enable(UART4, USART_INT_RBNE);
    usart_interrupt_enable(UART4, USART_INT_IDLE);
}
void Usart5Hwi(void){
    nvic_irq_enable(USART5_IRQn, 0, 0);
    usart_flag_clear(USART5, USART_INT_RBNE);
    usart_flag_clear(USART5, USART_INT_IDLE);
    LOS_HwiCreate((USART5_IRQn + 16), 0, 0, USART5_IRQHandler, NULL);
    usart_interrupt_enable(USART5, USART_INT_RBNE);
    usart_interrupt_enable(USART5, USART_INT_IDLE);
}
void Usart6Hwi(void){
    nvic_irq_enable(UART6_IRQn, 0, 0);
    usart_flag_clear(UART6, USART_INT_RBNE);
    usart_flag_clear(UART6, USART_INT_IDLE);
    LOS_HwiCreate((UART6_IRQn + 16), 0, 0, UART6_IRQHandler, NULL);
    usart_interrupt_enable(UART6, USART_INT_RBNE);
    usart_interrupt_enable(UART6, USART_INT_IDLE);
}
void Usart0Req(void)
{
	Seria_SendArray(USART0,USART0_TX_BUF,sizeof(USART0_TX_BUF));
}
void Usart1Req(void)
{
	Seria_SendArray(USART1,USART1_TX_BUF,sizeof(USART1_TX_BUF));
}
void Usart2Req(void)
{
	Seria_SendArray(USART2,USART2_TX_BUF,sizeof(USART2_TX_BUF));
}
void Usart3Req(void)
{
	Seria_SendArray(UART3,USART3_TX_BUF,sizeof(USART3_TX_BUF));
}
void Usart4Req(void)
{}
void Usart5Req(void)
{
}
void Usart6Req(void)
{}

void UsartInit(void)
{
    // 空气质量传感器MS-VOC-V4
    usart0_init(9600U);
    //甲醛传感器SC11-CH2O
    usart1_init(9600U);
    //红外二氧化碳传感器CM1106
    usart2_init(9600U);
    //红外二氧化碳传感器CM1106
    usart3_init(9600U);
    //RS485串口通讯
    usart4_init(9600U);
    //esp32c3串口通讯
    usart5_init(115200U);
    //屏幕MCU串口通讯
    usart6_init(115200U);
}

